app/controllers/tasks_controller.rb

  def show
    DateTime.parse(params[:id]) #strong parameters
    today = DateTime.parse(params[:id]) #strong parameters
    @date = params[:id]
    @tasks = Task.where("date = :date", date: today.strftime('%Y-%m-%d'))
---
SELECT "tasks".* FROM "tasks" WHERE (date = '2016-06-02')

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "duration", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asdf"], ["duration", 2], ["date", "2016-06-02"], ["created_at", "2016-06-28 00:36:53.001628"], ["updated_at", "2016-06-28 00:36:53.001628"]]